Ran Plan for project: `sharedservices-prod` dir: `accounts/sharedservices-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_integration.gpt_ig_caption_int will be created
+ resource "aws_api_gateway_integration" "gpt_ig_caption_int" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "70paytfqfb"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.gpt_ig_caption_post will be created
+ resource "aws_api_gateway_method" "gpt_ig_caption_post" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "70paytfqfb"
    }

  # aws_api_gateway_resource.gpt will be created
+ resource "aws_api_gateway_resource" "gpt" {
      + id          = (known after apply)
      + parent_id   = "wz1cllrxrg"
      + path        = (known after apply)
      + path_part   = "gpt"
      + rest_api_id = "70paytfqfb"
    }

  # aws_api_gateway_resource.gpt_ig_caption will be created
+ resource "aws_api_gateway_resource" "gpt_ig_caption" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "ig-caption"
      + rest_api_id = "70paytfqfb"
    }

  # aws_api_gateway_stage.api_stage will be updated in-place
~ resource "aws_api_gateway_stage" "api_stage" {
      ~ deployment_id         = "bdfpaj" -> "auxvbl"
        id                    = "ags-70paytfqfb-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.gpt_ig_caption will be created
+ resource "aws_lambda_function" "gpt_ig_caption" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/websites/feedutopia/backend/gpt_ig_caption/gpt_ig_caption.zip"
      + function_name                  = "sharedservices-gpt-ig-caption"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:113088814899:layer:AWSSDKPandas-Python312:3",
          + "arn:aws:lambda:us-east-2:825765422855:layer:Python_openai:1",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::825765422855:role/sharedservices_lambda_role"
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "sA55XqvcME0z0+lVxt3H5CP52JOAcrdxye2IyXLm9dw="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "sharedservices"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "OPENAI_API_KEY" = "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"
              + "OPENAI_MODEL"   = "gpt-4.1"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.allow_apigw_invoke_gpt_ig_caption will be created
+ resource "aws_lambda_permission" "allow_apigw_invoke_gpt_ig_caption" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sharedservices-gpt-ig-caption"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-2:825765422855:70paytfqfb/*/POST/gpt/ig-caption"
      + statement_id        = "AllowAPIGwInvokeGPTCaption"
      + statement_id_prefix = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p sharedservices-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fsharedservices-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p sharedservices-prod
  ```
Plan: 6 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```